#ifndef UNKNOWN_STRUCTS_H
#define UNKNOWN_STRUCTS_H

#include "inttypes.h"

typedef struct {
    /* 0x00 */ int32_t unk_0x00;
    /* 0x04 */ int32_t unk_0x04;
    /* 0x08 */ int32_t unk_0x08;
    /* 0x0C */ int32_t unk_0x0C;
    /* 0x10 */ int32_t unk_0x10;
    /* 0x14 */ int32_t unk_0x14;
    /* 0x18 */ int32_t unk_0x18;
} struct_D_800F20CC; /* sizeof = 0x1C */

typedef struct {
    /* 0x000 */ uint8_t unk_0x00;
    /* 0x001 */ uint8_t unk_0x01;
    /* 0x002 */ uint8_t unk_0x02;
    /* 0x003 */ uint8_t unk_0x03;
    /* 0x004 */ uint8_t unk_0x04[0x350];
    /* 0x354 */ uint8_t unk_0x354;
    /* 0x355 */ uint8_t unk_0x355;
    /* 0x366 */ uint8_t unk_0x356;
    /* 0x357 */ uint8_t unk_0x357;
} struct_D_80124ECD; /* sizeof = unk */

#endif

